Revit 2024 API
CurveLoop.IsOpen Method
 Returns whether the curve loop is open or closed, as determined by an internal flag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsOpen()
Visual Basic
Public Function IsOpen As Boolean
Visual C++
public:
bool IsOpen()
Return Value
 True if the CurveLoop is marked open, false if marked closed.
Remarks
 Some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves. In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace